[
  "Focus is the new IQ",
  "You can endure the pain of discipline or endure the pain of regret",
  "We haven't got time to automate this stuff, because we're too busy dealing with the problems caused by our lack of automation",

  "When you write code, pretend the next person who maintains it is just somebody trying to make it through the week",
  "There is a tremendous amount of work between a good idea and a great product",
  "Before software can be re-useable, it must be useable",

  "Design principles don't make good designs, people do",
  "Given enough time, every technical decision will turn out to be the wrong one",
  "Code must be written for people to read, and only incidentally for machines to execute",

  "The effort takes motivation",
  "The only true authority stems from knowledge, not from position",
  "Any fool can write code that a computer can understand. Good programmers write code that humans can understand",

  "On the seventh day, God said, 'Ship it! We'll release patches later.'",
  "Simplicity at the core allows for complexity at the edge",
  "Shut up, and show me code",

  "There are no mistakes in life just lessons",
  "It's usually easier to do something first than to do something right. But only one matters to customers",
  "In theory, there is no difference between theory and practice. But, in practice, there is",

  "The real question is not whether machines think but whether men do",
  "A hacker may agree to accept some kinds of authority in order to get something he wants more than the time he spends following orders",
  "Attitude is no substitute for competence",

  "Enterprise apps have the same acceptance hurdle as consumer apps: around 30 seconds to win the user over or they have failed",
  "Make your code look like what it does",
  "The single worst thing about the Internet is absolute destruction of attention spans",

  "EASY: \n> 1 blaming \n> 2 judging \n> 3 imitating \n> 4 pretending \n> 5 waiting \n> HARD: \n> 1 learning \n> 2 teaching \n> 3 inspiring \n> 4 improving \n> 5 giving",
  "The world is full of fascinating problems waiting to be solved",
  "No problem should ever have to be solved twice",

  "A group of two or more programmers is known as a merge conflict",
  "Boredom and drudgery are evil",
  "Good code is its own best documentation. As you're about to add a comment, ask yourself: \n> 'How can I improve the code so that this comment isn't needed?' \n> Improve the code and then document it to make it even clearer",

  "Freedom is good",
  "Change is a constant that never change",
  "Anyone who can give you orders can stop you from solving whatever problem you're being fascinated by",

  "Walking on water and developing software from a specification are easy if both are frozen",
  "A clever person solves a problem. A wise person avoids it",
  "When all you have is a hammer, everything starts to look like a nail",

  "The fool wonders, the wise man asks",
  "Writing code is like writing a book, your efforts are for _other_ readers and yourself",
  "Hackers won't let posers waste their time, but they worship competence",

  "Help test and debug open-source software",
  "You will be judged by your defaults",
  "Debugging is twice as hard as writing the code in the first place",

  "Hackers are naturally anti-authoritarian",
  "You can have the project: \n> -Done On Time\n> Done On Budget\n> Done Properly\n> Pick two.",
  "Nine people can't make a baby in a month",

  "Creative brains are a valuable, limited resource",
  "If debugging is the process of removing software bugs, then programming must be the process of putting them in",
  "There are only two kinds of languages: the ones people complain about and the ones nobody uses",

  "Being a hacker is lots of fun, but it's a kind of fun that takes lots of effort",
  "When a measure becomes a target, it ceases to be a good measure",
  "Given enough eyeballs, all bugs are shallow",

  "If you revere competence, you'll enjoy developing it in yourself",
  "Every build tool, every static checker and every communication tool has good and bad use cases, \n>  and you need people to tell you about it, not to blindly apply something that looked good in a different context months ago",
  "When I see a bird that walks like a duck and swims like a duck and quacks like a duck, I call that bird a duck",

  "You have to learn to distrust attitude and respect competence of every kind",
  "What's the simplest thing that could possibly work?",
  "Being a good software engineer is 3% talent, 97% not being distracted by the internet",

  "Write open-source software",
  "There are two ways of constructing a software design: \n> One way is to make it so simple that there are obviously no deficiencies, \n> and the other way is to make it so complicated that there are no obvious deficiencies",
  "A computer lets you make more mistakes faster than any invention in human history—with the possible exceptions of handguns and tequila",

  "Learn to write your native language well",
  "The difficulty of a bug can be measured as the distance, in lines of code, from the cause of a bug to the visible symptom of a bug",
  "53% of mobile site visits are abandoned if pages take >3s to load",

  "Hackers solve problems and build things, and they believe in freedom and voluntary mutual help",
  "Static types obviously create more syntax noise, and that syntax makes code harder to read, and harder to maintain",
  "The future has already arrived. It's just not evenly distributed yet",

  "Critique by creating",
  "Type correctness does not guarantee program correctness",
  "And once you start hallucinating after staring at the monitor for twelve hours, the quality of your work goes down the drain",

  "Productivity is never an accident. It is always the result of a commitment to excellence, intelligent planning, and focused effort",
  "All that a process/task does in an application is transforming some data into a different representation. Functional Programming makes this explicit",
  "When Chuck Norris throws exceptions, it's across the room",

  "Learning never exhausts the mind",
  "Duck typing is a method of type checking that looks at the structure of a value rather than its name or class",
  "Computer Science is no more about computers than astronomy is about telescopes",

  "Unhappiness (almost) always has to do with a significant discrepancy between self-image and reality",
  "To make something simple complex, or to make something complex simple",
  "Maintaining legacy code is boring",

  "A good piece of code you can read without comments and it's immediately obvious why it's been written, how it's elegant",
  "You can use the pepper grinder to create pepper by turning the crank \n> ...but, a pepper grinder is not pepper, so you must not try to eat it!",
  "You can take a man to water, but you can't make a man drink",

  "Building new software is the perfect activity for someone who likes art, science, business, or adrenaline",
  "The first step toward unmaintainable code is perceiving your users as fools",
  "It's not about what you do on Sunday, it's about what you do to get to the Sunday",

  "If your hobby can't support you, find a job that supports your hobby",
  "There is fundamental difference between refactoring and rewrite",
  "It's time to stand up and fight for what you believe in",

  "Writing your own open source project requires a lot of effort, and it needs funding",
  "Think through the requirements of the task at hand, instead of following design patterns blindly",
  "Knowing is not enough, you must apply; willing is not enough, you must do",

  "The framework you are using should depend on your code, not the other way around",
  "Think about what you want to implement, not how to implement it",
  "There's a difference between knowing the path and walking the path",

  "If you see this, then probably everything else is lost. \n> That's the last quote from me my friend. \n> I hope you enjoyed my wisdom and learned something positive from it \n _the thoughtful programmer_ :robot_face:"
]
